app/Controllers/LoginController.php

SELECT *
FROM `member`
WHERE `email` = 'admin@admin.com'
 LIMIT 1
---

        // Cari user berdasarkan email
        $model = new MMember();
        $member = $model->where('email', $email)->first();