app/Controllers/ProdukController.php

    public function create()
    {
        $input = $this->getInputData();

        $kode_produk = $input['kode_produk'] ?? null;
        $nama_produk = $input['nama_produk'] ?? null;
        $harga       = $input['harga'] ?? null;

        if (!$kode_produk || !$nama_produk || !$harga) {
            return $this->responseHasil(400, false, "Semua field wajib diisi");
        }

        $model = new MProduk();
        $model->insert([
            'kode_produk' => $kode_produk,
            'nama_produk' => $nama_produk,
            'harga'       => $harga
        ]);

        $produk = $model->find($model->getInsertID());
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('A001', 'Realme Smart TV 58 Inch', '5700000')
SELECT *
FROM `produk`
WHERE `produk`.`id` = 1

    public function detail($id)
    {
        $model = new MProduk();
        $produk = $model->find($id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'

    public function ubah($id)
    {
        $input = $this->getInputData();

        $kode_produk = $input['kode_produk'] ?? null;
        $nama_produk = $input['nama_produk'] ?? null;
        $harga       = $input['harga'] ?? null;

        if (!$kode_produk || !$nama_produk || !$harga) {
            return $this->responseHasil(400, false, "Semua field wajib diisi");
        }

        $model = new MProduk();
        $model->update($id, [
            'kode_produk' => $kode_produk,
            'nama_produk' => $nama_produk,
            'harga'       => $harga
        ]);

        $produk = $model->find($id);
---
SELECT *
FROM `produk`
WHERE `produk`.`id` = '1'

    public function hapus($id)
    {
        $model = new MProduk();
        $model->delete($id);
---
DELETE FROM `produk`
WHERE `id` IN ('3')